{
    "nodes": [
        {
            "node": {
                "title": "2013 Business Survey",
                "author-id": "1",
                "posted": "Friday, June 13, 2014 - 10:27",
                "updated": "Friday, June 13, 2014 - 10:29",
                "body": "Portumna Chamber Survey 2013\nThe following survey does not reflect the opinions of the Chamber of Commerce, all the answers and results are from the people that answered the survey.\nThis is the opinion of yourselves the people of Portumna, the employers of Portumna and the employees of Portumna.\nHopefully there is something we can all take from the survey to improve our business and help the town be what it can be.\nFirstly, we believe people have forgotten,  What Does a Chamber of Commerce Do? \nThe Chamber of Commerce is the voice of business. \nThe Chamber of Commerce is a catalyst — a common vehicle mobilising enlightened members from all segments of the business community to work together for the common good of the total community. \nWith the aim of achieving economic success, staff, volunteers and business people strive to keep their area’s economic conditions at a level where businesses and residents willingly and enthusiastically risk their capital in their community in the hope of making a profit. \nEverything else the Chamber does is a means to an end (events, mixers, fundraisers and meetings).\nWHO FUNDS THE CHAMBER OF COMMERCE?\nThe Chamber of Commerce is funded by the membership with the assistance of fundraising activities.\nWHO RUNS THE CHAMBER?\nA Board of Directors, elected by the Chamber of Commerce’s members, runs the organisation. The Board, serving as volunteers, sets the policies and goals of the organization. If the Chamber of Commerce is large enough, the Board employs an administrative head.\nWHAT DO THE VOLUNTEERS DO?\nVolunteers provide the ideas, the drive, the goals, the funds and the voluntary services to keep the Chamber of Commerce motivated and operating.\nDO MEMBERS EVER DISAGREE WITH WHAT THE CHAMBER DOES?\nThe only way for the Chamber to avoid disagreement on some ground is to do nothing at all, or do only those rare things in which everybody agrees. But that would mean a meaningless or feeble programme of activity.\nWHAT IS THE BENEFIT OF MEMBERSHIP?\nThe major benefit of membership is the Chamber of Commerce acts as the unified voice of the area businesses, including industry and professional firms. Strong membership involvement in its activities will increase the impact and effectiveness of the organisation. Chamber of Commerce membership is an investment in the present and future of the individual’s and the community’s welfare.\nWHAT IS THE BENEFIT OF A CHAMBER TO THE COMMUNITY?\nIn any community, it is from the profitable operation of business that all other benefits result. Only by succeeding in this fundamental goal can a community provide the jobs and produce the wealth to finance all of the cultural, charitable and various other needs a community is faced with everyday.\n \n \nWhat is the Chamber of Commerce there for?\n \n \nThe role of the Chamber of Commerce is to promote local businesses, represent them on business related issues, and also sponsor local business events. A Chamber of Commerce is a non profit organisation of local businesses.\n \nChambers of Commerce exist to make a difference to your business, whether that means ensuring your views are heard within government, opening new business opportunities in local, national and international markets or providing critical business advice, services and skills development.\n \nA Chamber of Commerce refers to an association of business people to advance commercial and industrial interests in the community. Some offer awards to its members to recognise and celebrate business excellence through the successes and achievements of the members.\n \nYour local Chamber of Commerce is a trade organisation that is designed to promote commerce (business) within their community. The Chamber is a great place to find businesses in your area that offer goods and services in your community.\n \nThe Chamber of Commerce is a network of businesses whose main objective is to promote and ensure the livelihood of local businesses. A board of directors, who are active members in their local Chamber of Commerce, set the policies for the organisation.\n \n \n \n \n \n \nSurvey 2013 – 5 Simple Questions & anything else people felt relevant.\n1. How many people do you employ  - _____________________\n \n2. What percentage approximately eat breakfast or lunch or dinner in Portumna – \n__________________________________\n \n3. What do you feel Portumna is Lacking in for you and your Employees\/Customers?\n___________________________________________________________________\n \n___________________________________________________________________\n4. What do you feel Portumna has an Advantage for you and your Employees\/Customers?\n_______________________________________________________________________________\n \n_______________________________________________________________________________\n5. How much of percentage of business do you think you have lost since the Shannon Oaks Closed ? \n_______________________________\n6. Anything else you feel is relevant\n_______________________________________________________________________________\n \n \nSurvey 2013\nWho was the survey sent to?\n88 surveys sent to businesses of which 42 replied\n150 surveys sent to employees of 3 of the largest employers in Portumna of which 150 replied\n \nMost businesses are the owner and 1 - 3 staff.\nOwners are also employees, over 1,000 people are employed in the area.\n1 - 3 employed                75%\n4 - 9 employed                16%\n10 - 20 employed             6%\n20 or more employed      3%\n \nEating Patterns\n35% of persons employed in the town and area eat a least once a day in town.\n \nLoss of business through the closure of the Shannon Oaks?\n Most businesses do not realise how much business they have actually lost because of the loss of the hotel.\nWe cannot change the circumstances at the moment only look after our current customers and work towards\nbringing and keeping more business in town.\nLost trade                    % of Businesses\n1 - 3%                                      60%\n4 - 9%                                      20%\n10 - 20%                                 13%\n20 - 50%                                   7%\n50% or more                           0%\nSome businesses have been hit harder than others and others are unsure as to how hard they have actually been hit.\nSome businesses have closed since the closure of the hotel, but a lot have opened also.\nThey new businesses must see potential, existing businesses must grasp that potential also.\nLater on we will see how businesses can help themselves as answered by employers and customers.\n \nList Of Physical Advantages\n \nAlphabetical\nAldi\nCastle\nCentral Location\nCountry Market\nCreche Facilities\nForest Park\nGolf Club\nGood range of shops\/cafes\nLots of Local Activities\nLough Derg\nMarina\nPallas Karting\nRiver Shannon\nTennis Club\nWorkhouse\n \nList Of Social Advantages \nFree Parking\nCentral Location\nClean & Tidy\nLots to Do, Activities, etc\nCommunity Feel\nExcellent Creche Facilties\nLots of rentable properties\nFriendliness and pleasant people\nJust a nice town with everything you need, maybe not everything you want, but everything you need.\nGood access to the motorways and easy access\nSmall enough but big enough\nPicturesque Village\n \nList of what Portumna is Lacking\n95% -  Shops\/Hardware\/Pharmacies Closing at Lunch Time\n80% - Parking by employers\/employees problem, taking up customer parking\n75% - Reliable ATM and Banking Hours\n40% - Huge Lack of Community Spirit\n40% - Patrick Street - Parking problems\/Traffic problems\/Old People access to Post Office problems\nLack of a social scene\nCan you rent a bike in town?\nCan you rent Kayaks\/Canoes for lake???\nConsistent good food with efficient service\nEvents\/Festivals  - should be Pubs\/B&B's\/shops driven\nTourist Flyer\/Brochure needed\nForest Park under utilised - Ice Cream\/Shop\/Rent A Bike - Otherwise People Just Come & Go\nHotel - no focal point\nLeisure Centre\nToo Few people trying to do something about things\nVisitors\/Tourists no where to stay\nNot enough joined up thinking by all the organisations\n \n What Can YOU Do To Help Your Business\nKeep Your Business Open During Lunch Times  - OBVIOUS\nDo NOT Park Outside\/Near Your Business or Outside Someone Elses Business - OBVIOUS\nGive Cash Back to your Customers when paying with Debit or Credit Card - To your ADVANTAGE\nPatrick Street - Parking\/Access Problems - no one from business should be parking on this street\nCommunity Spirit is INTANGIBLE but it can be FELT\n- Smile, Say Hello & Thank People for their Custom\n- If you are LUCKY enough to have a queue of people - get through the customers quickly\n- Chat after you have taking the money from your customers - You will be long enough QUIET.\n- Join Clubs\/Societies\/Committees - Be a Part of the Community not APART\n- Teamwork divides the task and multiplies the success\n- How can you expect business from business people if you do not do Business with them.\n- You cannot give out if you do not partake \nFestivals\/Events\n- Great Outdoors Festival\/Splash Day\/Shorelines Festival\n- Brings business to the town\n- Chamber of Commerce - should it be involved\n- Who should Run these events - who makes the money?? \n \nRude Staff\n- It is RUDE not to deal with your customer straight away. Staff can chat to each other again\nwhen they have finished serving. The customer is not in the way of your day they are paying your wages.\n \n"
            }
        }
    ]
}
